#include "Notes.h"

int Mode()
{
		Message(11, "\n\nОберіть модель");
		cout << "Шукати усі обернення та розташування - 0" << endl;
		cout << "Шукати лише розташування, в яких 9-, 11- і 13- тони";
		Color(6);
		cout << " вищі ";
		Color(7);
		cout << "за основний тон щонайменш на нону - 1\n";

		int mode = EnterNum(1);
		return mode;
}

int ChooseOperation()
{
	Message(11, "\nОберіть операцію");
	cout << "\nВивести усі ундецимакорди в порядку обернень - 1\nВивести лише нонакорди з ноною у мелодичному положенні -2\nвивести лише акорди з інтервалом ундецими між крайніми голосами -3\nВивести усі акорди в порядку зростання діапазону - 4\nВивести нонакорди та обернення від заданої ноти - 5\nВивести нонакорди та обернення із заданим мелодичним тоном - 6 " << endl;
	int choice = EnterNum(6);
	return choice;
}